import about from "./images/about.jpg";
import "./App.css";
import { Book } from "./components/Book";
import { Skills } from "./components/Skills";

function App() {
  return (
    <>
      <header className="header">
        <div className="header__logo-wrapper">
          <svg viewBox="0 0 1024 1024" class="icon" version="1.1" xmlns="http://www.w3.org/2000/svg" fill="#000000">
            <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
            <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
            <g id="SVGRepo_iconCarrier">
              <path
                d="M385.86 647.77C341 607 261.3 383.16 322.21 255.55S497.47 97.32 577.57 133.4 730.33 348.85 725 453.59s-69.16 192.08-131.3 201.47-207.84-7.29-207.84-7.29z"
                fill="#7FB870"></path>
              <path
                d="M372.65 299.23s-46.39 70.25 18.56 326.09L411.1 628s-50.38-242.61-38.45-328.77zM441.58 267.42s-41.09 111.35 17.23 357.9L478.7 628s-49.05-274.42-37.12-360.58zM513.16 262.12s-37.12 119.3 5.3 355.25l19.88 1.33s-10.6-251.87-25.18-356.58zM576.79 252.84s1.33 249.2-4 365.85l19.88 2.65s14.61-188.23-15.88-368.5zM633.79 278s87.49 141.83-1.47 340.67l-19.88 2.65S668.25 508.67 633.79 278z"
                fill="#458E6B"></path>
              <path d="M561.54 173.3l-14.91-79.53 39.77 37.78 35.79-67.6 6.96 72.57 56.67-11.93-63.63 67.6-60.65-18.89z" fill="#FFEB05"></path>
              <path d="M331.78 664h370.44v223.56a66.49 66.49 0 0 1-66.49 66.49H398.27a66.49 66.49 0 0 1-66.49-66.49V664z" fill="#F5CAC5"></path>
              <path d="M261.83 608.14l510.34 0 0 73.21-510.34 0 0-73.21Z" fill="#F5CAC5"></path>
              <path d="M735.57 681.34H298.43a36.71 36.71 0 0 1-36.6-36.6h510.34a36.71 36.71 0 0 1-36.6 36.6z" fill="#C7A19D"></path>
              <path
                d="M413.62 730.32c0.13 12.94-18.17 18.17-18.17 18.17s-18.17-5.1-18.17-18.17c0-10 10.46-14.38 18.17-3.4 5.88-11.76 18.07-6.63 18.17 3.4zM483.11 776.44c0.13 12.94-18.17 18.17-18.17 18.17s-18.17-5.1-18.17-18.17c0-10 10.46-14.38 18.17-3.4 5.88-11.76 18.06-6.63 18.17 3.4zM602.15 730.32c0.13 12.94-18.17 18.17-18.17 18.17s-18.17-5.1-18.17-18.17c0-10 10.46-14.38 18.17-3.4 5.88-11.76 18.02-6.63 18.17 3.4zM654.88 784.4c0.13 12.94-18.17 18.17-18.17 18.17s-18.17-5.1-18.17-18.17c0-10 10.46-14.38 18.17-3.4 5.88-11.77 18.06-6.64 18.17 3.4zM404.69 835.41c0.13 12.94-18.17 18.17-18.17 18.17s-18.17-5.1-18.17-18.17c0-10 10.46-14.38 18.17-3.4 5.88-11.76 18.06-6.63 18.17 3.4zM474.17 897.44c0.13 12.94-18.17 18.17-18.17 18.17s-18.17-5.1-18.17-18.17c0-10 10.46-14.38 18.17-3.4 5.89-11.76 18.07-6.63 18.17 3.4zM569.36 835.41c0.13 12.94-18.17 18.17-18.17 18.17S533 848.48 533 835.41c0-10 10.46-14.38 18.17-3.4 5.9-11.76 18.09-6.63 18.19 3.4zM653.9 897.44c0.13 12.94-18.17 18.17-18.17 18.17s-18.17-5.1-18.17-18.17c0-10 10.46-14.38 18.17-3.4 5.88-11.76 18.07-6.63 18.17 3.4z"
                fill="#3B5174"></path>
            </g>
          </svg>
          <div className="header__logo-text">Шуйская Елена</div>
        </div>
        <a href="tel:+79021807463" className="header__link">
          +7 (902) 180-74-63
        </a>
      </header>
      <main className="main">
        <section className="about">
          <div className="about__container about__left">
            <img src={about} className="about__image" alt="Фотография Шуйской Елены" />
          </div>
          <div className="about__container about__right">
            <p>
              Меня зовут Шуйская Елена, и с 2015 года я специализируюсь на фронтенд-разработке и создании веб-сайтов. Моя основная деятельность заключается в разработке новых
              сайтов, обслуживании существующих проектов и обновлении уже запущенных онлайн-ресурсов. Особое внимание я уделяю модернизации устаревших интерфейсов, делая их более
              современными и удобными для пользователей.
            </p>
            <p>
              В рамках своей профессиональной деятельности я накопила обширный опыт работы в различных веб-агентствах, где участвовала как в небольших, так и в крупных проектах.
              Кроме того, у меня есть опыт командной работы в больших компаниях, что помогло мне лучше понять внутренние процессы взаимодействия между разработчиками.
            </p>
            <p>
              За время моей карьеры мне довелось поработать над множеством проектов &mdash; от простых одностраничных сайтов до сложных многостраничных порталов. Это разнообразие
              позволяет мне уверенно справляться с задачами любой сложности.
            </p>
            <p>
              Я люблю разбираться в том, как работает Интернет и использовать самые последние технологии в своей работе. Это позволяет мне создавать сайты, которые не только
              выглядят привлекательно, но и работают быстро и эффективно.
            </p>
            <a className="about__link" href="https://syzran.hh.ru/resume/71482345ff026032b60039ed1f59646d553346?print=true">
              Скачать резюме в PDF
            </a>
            <ul className="about__list-icons">
              <li className="about__item-icon">
                <a href="https://t.me/schujskaya" target="_blank" rel="noreferrer">
                  <svg xmlns="http://www.w3.org/2000/svg" width="50" height="50" fill="#24A1DE" class="bi bi-telegram" viewBox="0 0 16 16">
                    <path d="M16 8A8 8 0 1 1 0 8a8 8 0 0 1 16 0M8.287 5.906q-1.168.486-4.666 2.01-.567.225-.595.442c-.03.243.275.339.69.47l.175.055c.408.133.958.288 1.243.294q.39.01.868-.32 3.269-2.206 3.374-2.23c.05-.012.12-.026.166.016s.042.12.037.141c-.03.129-1.227 1.241-1.846 1.817-.193.18-.33.307-.358.336a8 8 0 0 1-.188.186c-.38.366-.664.64.015 1.088.327.216.589.393.85.571.284.194.568.387.936.629q.14.092.27.187c.331.236.63.448.997.414.214-.02.435-.22.547-.82.265-1.417.786-4.486.906-5.751a1.4 1.4 0 0 0-.013-.315.34.34 0 0 0-.114-.217.53.53 0 0 0-.31-.093c-.3.005-.763.166-2.984 1.09"></path>
                  </svg>
                </a>
              </li>
              <li className="about__item-icon">
                <a href="https://vk.me/id15776543" target="_blank" rel="noreferrer">
                  <svg fill="none" height="50" width="50" viewBox="0 0 48 48" xmlns="http://www.w3.org/2000/svg">
                    <path
                      d="M0 23.04C0 12.179 0 6.748 3.374 3.374S12.18 0 23.04 0h1.92c10.861 0 16.292 0 19.666 3.374C48 6.748 48 12.18 48 23.04v1.92c0 10.861 0 16.292-3.374 19.666C41.252 48 35.82 48 24.96 48h-1.92c-10.861 0-16.292 0-19.666-3.374C0 41.252 0 35.82 0 24.96z"
                      fill="#0077FF"></path>
                    <path
                      d="M25.54 34.58c-10.94 0-17.18-7.5-17.44-19.98h5.48c.18 9.16 4.22 13.04 7.42 13.84V14.6h5.16v7.9c3.16-.34 6.48-3.94 7.6-7.9h5.16c-.86 4.88-4.46 8.48-7.02 9.96 2.56 1.2 6.66 4.34 8.22 10.02h-5.68c-1.22-3.8-4.26-6.74-8.28-7.14v7.14z"
                      fill="#FFFFFF"></path>
                  </svg>
                </a>
              </li>
              <li className="about__item-icon">
                <a href="https://leetcode.com/u/tcRvQL7Kod/" target="_blank" rel="noreferrer">
                  <svg height="50" width="50" viewBox="0 0 95 111" fill="none" xmlns="http://www.w3.org/2000/svg" class="h-full w-auto max-w-none">
                    <path
                      d="M68.0063 83.0664C70.5 80.5764 74.5366 80.5829 77.0223 83.0809C79.508 85.579 79.5015 89.6226 77.0078 92.1127L65.9346 103.17C55.7187 113.371 39.06 113.519 28.6718 103.513C28.6117 103.456 23.9861 98.9201 8.72653 83.957C-1.42528 74.0029 -2.43665 58.0749 7.11648 47.8464L24.9282 28.7745C34.4095 18.6219 51.887 17.5122 62.7275 26.2789L78.9048 39.362C81.6444 41.5776 82.0723 45.5985 79.8606 48.3429C77.6488 51.0873 73.635 51.5159 70.8954 49.3003L54.7182 36.2173C49.0488 31.6325 39.1314 32.2622 34.2394 37.5006L16.4274 56.5727C11.7767 61.5522 12.2861 69.574 17.6456 74.8292C28.851 85.8169 37.4869 94.2846 37.4969 94.2942C42.8977 99.496 51.6304 99.4184 56.9331 94.1234L68.0063 83.0664Z"
                      fill="#FFA116"></path>
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M41.1067 72.0014C37.5858 72.0014 34.7314 69.1421 34.7314 65.615C34.7314 62.0879 37.5858 59.2286 41.1067 59.2286H88.1245C91.6454 59.2286 94.4997 62.0879 94.4997 65.615C94.4997 69.1421 91.6454 72.0014 88.1245 72.0014H41.1067Z"
                      fill="#B3B3B3"></path>
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M49.9118 2.02335C52.3173 -0.55232 56.3517 -0.686894 58.9228 1.72277C61.494 4.13244 61.6284 8.17385 59.2229 10.7495L16.4276 56.5729C11.7768 61.552 12.2861 69.5738 17.6453 74.8292L37.4088 94.2091C39.9249 96.6764 39.968 100.72 37.505 103.24C35.042 105.761 31.0056 105.804 28.4895 103.337L8.72593 83.9567C-1.42529 74.0021 -2.43665 58.0741 7.1169 47.8463L49.9118 2.02335Z"
                      fill="black"></path>
                  </svg>
                </a>
              </li>
              <li className="about__item-icon">
                <a href="https://github.com/schujskaya" target="_blank" rel="noreferrer">
                  <svg height="50" aria-hidden="true" viewBox="0 0 24 24" version="1.1" width="50" data-view-component="true" class="octicon octicon-mark-github v-align-middle">
                    <path d="M12.5.75C6.146.75 1 5.896 1 12.25c0 5.089 3.292 9.387 7.863 10.91.575.101.79-.244.79-.546 0-.273-.014-1.178-.014-2.142-2.889.532-3.636-.704-3.866-1.35-.13-.331-.69-1.352-1.18-1.625-.402-.216-.977-.748-.014-.762.906-.014 1.553.834 1.769 1.179 1.035 1.74 2.688 1.25 3.349.948.1-.747.402-1.25.733-1.538-2.559-.287-5.232-1.279-5.232-5.678 0-1.25.445-2.285 1.178-3.09-.115-.288-.517-1.467.115-3.048 0 0 .963-.302 3.163 1.179.92-.259 1.897-.388 2.875-.388.977 0 1.955.13 2.875.388 2.2-1.495 3.162-1.179 3.162-1.179.633 1.581.23 2.76.115 3.048.733.805 1.179 1.825 1.179 3.09 0 4.413-2.688 5.39-5.247 5.678.417.36.776 1.05.776 2.128 0 1.538-.014 2.774-.014 3.162 0 .302.216.662.79.547C20.709 21.637 24 17.324 24 12.25 24 5.896 18.854.75 12.5.75Z"></path>
                  </svg>
                </a>
              </li>
            </ul>
          </div>
        </section>
        <Skills />
      </main>
      <footer></footer>
    </>
  );
}

export default App;